In [3]:
import numpy as np
import pandas as pd
vals=np.array([1, None, 3, 4])
vals

array([1, None, 3, 4], dtype=object)

In [8]:
for dtype in ['object', 'int']:
    print ("dtype=", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype= object
54.9 ms ± 332 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype= int
2.11 ms ± 29.1 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [9]:
data=pd.Series([1, np.nan, 'hello', None])

In [10]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [11]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [12]:
data.dropna()

0        1
2    hello
dtype: object

In [13]:
ser1=pd.Series(['A', 'B', 'C'], index=[1,2,3])
ser2=pd.Series(['D', 'E', 'F'], index=[4,5,6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [23]:
df1=pd.DataFrame({'employee':['BOb','Jake', 'Lisa', 'Sue'],
                 'group':['Accounting','Engineering','Engineering', 'HR']})
df2=pd.DataFrame({'employee':['Lisa', 'Bob', 'Jake','Sue'],
                 'hire_date':[2004, 2008, 2012, 2014]})
print(df1);print(df2)

  employee        group
0      BOb   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [26]:
df3=pd.merge(df1,df2)
df3

  employee        group  hire_date
0     Jake  Engineering       2012
1     Lisa  Engineering       2004
2      Sue           HR       2014

In [27]:
print(df1);print(df2);print(pd.merge(df1, df2, on='employee'))

  employee        group
0      BOb   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0     Jake  Engineering       2012
1     Lisa  Engineering       2004
2      Sue           HR       2014

In [28]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic =sns.load_dataset('titanic')

In [29]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [31]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [33]:
age= pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

class               First    Second     Third
sex    age
female (18, 80]  0.909091  1.000000  0.511628
       NaN       0.972973  0.900000  0.423729
male   (18, 80]  0.800000  0.600000  0.215686
       NaN       0.375000  0.071429  0.133663

In [34]:
fare = pd.qcut(titanic['fare'], 2)
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (18, 80]              NaN  1.000000  0.714286          0.909091
       NaN                   NaN  0.880000  0.444444          0.972973
male   (18, 80]              NaN  0.000000  0.260870          0.800000
       NaN                   0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (18, 80]  1.000000  0.318182
       NaN       0.914286  0.391304
male   (18, 80]  0.818182  0.178571
       NaN       0.030303  0.192308